In [1]:
# ⚙️ Operations in Pandas
# Pandas provides a wide range of operations to manipulate, analyze, and transform data efficiently.

# Here are the most useful types of operations:

In [3]:
import numpy as np 
import pandas as pd

In [7]:
# DataFrames Basic Operations

In [9]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [10]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [11]:
df.shape

(5, 3)

In [12]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [15]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [16]:
df["A"] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [6]:
# DataFrames Applying Functions

In [17]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [18]:
def square(x):
    return x**2

In [19]:
df["B"].apply(square)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [20]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [24]:
df["D"] = df["B"].apply(square)
df["D"]

0         100000000
1       25600000000
2      656100000000
3     6553600000000
4    39062500000000
Name: D, dtype: int64

In [25]:
df

   A        B    C               D
0  1    10000  100       100000000
1  2   160000  200     25600000000
2  3   810000  300    656100000000
3  4  2560000  400   6553600000000
4  5  6250000  500  39062500000000